Revit 2021.1 API
RebarBendData Members
The RebarBendData type exposes the following members.
Constructors
Name | Description
RebarBendData()
 Constructs a new RebarBendData with default settings.
RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation)
 Constructs a new RebarBendData using the bar type, hook types, style and orientation values.
Methods
Name | Description
Dispose
Releases all resources used by the RebarBendData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BarDiameter
 The diameter of the bar.
BendRadius
 The radius of all fillets, except hook fillets, in the Rebar shape.
HookAngle0
 The angle of the hook at the start.
HookAngle1
 The angle of the hook at the end.
HookBendRadius
 The radius of the hook fillets in the Rebar shape.
HookLength0
 The extension length of the hook at the start.
HookLength1
 The extension length of the hook at the end.
HookOrient0
 The orientation of the hook at the start.
HookOrient1
 The orientation of the hook at the end.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace